
#ifndef _DS1302_H_
#define _DS1302_H_

  #ifndef uchar
	#define uchar unsigned char
  #endif

  #ifndef uint
	#define uint  unsigned int
  #endif

#include"intrins.h"
#include "STC12C5A60S2.H" 


sbit DS1302_SCLK =P1^5;  //时钟
sbit DS1302_IO   =P1^6;  //数据输入输出
sbit DS1302_RST  =P1^7;  //复位/片选线

typedef struct
	{
		uchar SEC;			//00~59
		uchar MIN;			//00~59
		uchar HR;			//00-23
		uchar DATE;			//00-31
		uchar MONTH;		//01-12
		uchar DAY;			//01-07
		uchar YEAR;			//00-99
	}TIME_STRUCT;
extern TIME_STRUCT TIME;	//初始化时间参数

extern uchar dtime[7][2]; //保存的时间 字符


/******************************************************************** 
//函数名称: DS1302_WByte
//函数功能: 往DS1302 写入 1 Byte 数据
//输入值:   ndata: 寄存器的数据或地址
//返回值:   无
***********************************************************************/
extern void DS1302_WByte(uchar ndata); 

/******************************************************************** 
//函数名称: DS1302_RByte 
//函数功能: 从DS1302读取 1 Byte数据
//输入值:   无
//返回值:   ndata:读取的数据
***********************************************************************/
extern  uchar DS1302_RByte(void); 

/******************************************************************** 
//函数名称: DS1302_Wdata 
//函数功能: 往DS1302某地址写入某数据
//输入值:   nAddr: DS1302地址, ndata: 要写的数据
//返回值:   无
***********************************************************************/
extern void DS1302_Wdata(uchar nAddr, uchar ndata);

/******************************************************************** 
//函数名称: DS1302_Rdata 
//函数功能: 从DS1302某地址读取数据
//输入值:   nAddr: DS1302地址
//返回值:   ndata: 读取的数据
***********************************************************************/
extern uchar DS1302_Rdata(uchar nAddr);

/******************************************************************** 
//函数名称: InitDS1302
//函数功能: DS1302初始时间设定
//输入值:   无
//返回值:   无
***********************************************************************/
extern void InitDS1302(void);

/******************************************************************** 
//函数名称: GetDS1302
//函数功能: DS1302当前时间读取
//输入值:   无
//返回值:   无
***********************************************************************/
 extern  void GetDS1302(void);

#endif

 /*
 main()
{
   InitLCD();	   //初始化1602
   InitDS1302();   //测试断开电源时，电池供电功能     
   while(1)	       //进入死循环，防止看门狗复位
   {   
    GetDS1302();   //提取时间参数 
    xian1();	   //显示第一行	
    xian2();	   //显示第二行	    
   }
}
*/




