/*********************************************************************************************************
** 文件功能 ：串口通信相关程序
** 工程作者 ：Blue Sky Teams——ZZL
** 工程版本 ：V1.0
*********************************************************************************************************/


#ifndef _USART_H_
#define _USART_H_	

#include "STC12C5A60S2.H"      //包含头文件

  #ifndef uchar
	#define uchar unsigned char
  #endif

  #ifndef uint
	#define uint  unsigned int
  #endif


extern  uchar data_length,flag; //声明外部变量
extern  uchar data_buffer[10];  //缓存区

/*********************************************************************************************************
** 函数功能 ：串口初始化
** 函数说明 ：SMOD是电源控制寄存器中PCON的bit7位
**			  T1x12是辅助寄存器AUXR中的bit6位
** 			   实现串口外设的配置，波特率计算方法：SMOD   T1x12 
**	                                               0       0       FSCLK/32/12/(256-TH1)
**                                                 0       1       FSCLK/32/(256-TH1) 
**                                                 1       0       FSCLK*2/32/12(256-TH1)
**                                                 1       1       FSCKL*2/32/(256-TH1)
** 入口参数 ：无
** 出口参数 ：无 
** 详细的介绍请参看STC12C5A60S2.pdf第八章 串行口通信
*********************************************************************************************************/
extern void USART_Init();
  
/*********************************************************************************************************
** 函数功能 ：发送一个字符
** 入口参数 ：d：待发送的字符
** 出口参数 ：无
*********************************************************************************************************/
extern void Send_Byte(unsigned char c);
			 
/*********************************************************************************************************
** 函数功能 ：发送一定长度的字符串
** 入口参数 ：str：待发送字符串的地址
**            length：发送字符串的长度
** 出口参数 ：无
*********************************************************************************************************/
extern void Send_String(uchar *str ,uint length);	

unsigned char Uart_Receive_Byte(void);

/************************** (C) COPYRIGHT 2011 Blue Sky Teams *****END OF FILE*****************************/


#endif

 
