/*********************************************************************************************************
** 文件功能 ：AT24C02 驱动程序
** 文件说明 ：AT24C02的的三位地址线全部接地，故其地址为0xa0
** 工程作者 ：Blue Sky Teams——ZZL
** 工程版本 ：V1.0
*********************************************************************************************************/

#include"AT24C02.h"


/*********************************************************************************************************
** 函数功能 ：IIC起始信号
** 函数说明 ：SCL线为高电平期间，SDA线由高电平向低电平的变化表示起始信号
** 入口参数 ：无
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Start()
{
	AT24C02_SDA=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SDA=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
}
/*********************************************************************************************************
** 函数功能 ：IIC终止信号
** 函数说明 ：SCL线为高电平期间，SDA线由低电平向高电平的变化表示终止信号。
** 入口参数 ：无
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Stop() 
{
	AT24C02_SDA=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SDA=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();	
}
/*********************************************************************************************************
** 函数功能 ：IIC应答信号
** 函数说明 ：等待应答即SDA为低，若等待一定时间还没应答，默认为接受完了
** 入口参数 ：无
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Ack()
{
	uchar i=0;
	AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	while((AT24C02_SDA==1)&&(i<250))i++;
	AT24C02_SCL=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
}
/*********************************************************************************************************
** 函数功能 ：发送一个字节
** 入口参数 ：dat：待发送的字节
** 出口参数 ：无
*********************************************************************************************************/
void AT24C02_Write_Byte(dat)
{
	uchar temp,i;
	temp=dat;
	for(i=0;i<8;i++)
	{
		temp=temp<<1;
		AT24C02_SCL=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		AT24C02_SDA=CY;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	}
	AT24C02_SCL=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SDA=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();//释放数据总线，以便后面的应答信号
}
/*********************************************************************************************************
** 函数功能 ：接收一个字节
** 入口参数 ：无
** 出口参数 ：dat：接收到的字节
*********************************************************************************************************/
uchar AT24C02_Read_Byte()
{
	uchar dat,i;
    AT24C02_SCL=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SDA=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();//释放数据总线
	for(i=0;i<8;i++)
	{
		AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		dat=(dat<<1)|AT24C02_SDA;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
		AT24C02_SCL=0;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	}
	return(dat);
}
/*********************************************************************************************************
** 函数功能 ：AT24C02的初始化函数
** 函数说明 ：AT24C02初始化时SCL、SDA均为高电平
** 入口参数 ：无
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Init()
{
	AT24C02_SCL=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
	AT24C02_SDA=1;_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();_nop_();
}
/*********************************************************************************************************
** 函数功能 ：随机地址存储字节
** 函数说明 ：随机写入一个地址，将字节存在那个地址上
** 入口参数 ：dat：待存储的字节
**            add：存储字节的地址
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Write_Add(uchar dat,uchar add)
{
	AT24C02_Stop();//终止
	AT24C02_Start();//起始
	AT24C02_Write_Byte(0xa0);//从器件地址，即将进行写
	AT24C02_Ack();//应答
	AT24C02_Write_Byte(add);//字节地址
	AT24C02_Ack();//应答
	AT24C02_Write_Byte(dat);//写的数据
	AT24C02_Ack();//应答
	AT24C02_Stop();//终止	
}
/*********************************************************************************************************
** 函数功能 ：随机地址读取字节
** 函数说明 ：写入一个地址，读取这个地址上的字节
** 入口参数 ： add：待读取字节的地址        
** 出口参数 ：无 
*********************************************************************************************************/
uchar AT24C02_Read_Add(uchar add)
{
	uchar dat;
	AT24C02_Stop();//终止
	AT24C02_Start();//起始
	AT24C02_Write_Byte(0xa0);//从器件地址
	AT24C02_Ack();//应答
	AT24C02_Write_Byte(add);//字节地址
	AT24C02_Ack();//应答
	AT24C02_Start();//起始
	AT24C02_Write_Byte(0xa1);//从器件地址，即将进行读
	AT24C02_Ack();//应答
	dat=AT24C02_Read_Byte();//读回数据
	AT24C02_Stop();//终止
	return(dat);
}
/*********************************************************************************************************
** 函数功能 ：随机地址读取一页
** 函数说明 ：页写方式，地址必须满足页方式，才能被全部写进EEPROM；
**            如地址要为0x00,0x08，0x10这样写入的8个字节才能全部写进去，否则如写0x01则写入数据最后一个将无法写进！
** 入口参数 ：add：待存储字符串的地址
**            dat：待存储的字符串       
** 出口参数 ：无 
*********************************************************************************************************/
void AT24C02_Write_Page(uchar *dat,uchar add)
{
	uchar q;
	AT24C02_Stop();//终止
	AT24C02_Start();
	AT24C02_Write_Byte(0xa0);
	AT24C02_Ack();
	AT24C02_Write_Byte(add);
	AT24C02_Ack();
	for(q=0;dat[q]!='\0';q++)
	{
		AT24C02_Write_Byte(dat[q]);
		AT24C02_Ack();
	}
	AT24C02_Stop();
}
/************************** (C) COPYRIGHT 2011 Blue Sky Teams *****END OF FILE*****************************/   


