/*********************************************************************************************************
** 文件功能 ：LCD1602驱动程序
** 工程作者 ：Blue Sky Teams——ZZL
** 工程版本 ：V1.0
*********************************************************************************************************/

#ifndef _LCD1602_H_
#define _LCD1602_H_

#include <intrins.h>
#include "STC12C5A60S2.H" 

  #ifndef uchar
	#define uchar unsigned char
  #endif

  #ifndef uint
	#define uint  unsigned int
  #endif

/*********************************************************************************************************
** LCD1602接口定义
*********************************************************************************************************/
sbit RS_1602 = P2^5;	//数据命令选择端
sbit RW_1602 = P2^4;	//写选择端
sbit EN_1602 = P2^3;	//使能信号
#define LCD_PORT	P0 	//LCD1602数据接口

/*********************************************************************************************************
** LCD1602宏定义指令集
** 指令集的指令作为void Write_1602_Com(unsigned char zhiling)参数发送给LCD1602之后可以让液晶LCD1602执行相应的功能，
** 使用者可根据自己要实现的功能选择相应的指令，具体说明请参看文档“LCD1602液晶完整中文资料”有关指令的章节
*********************************************************************************************************/
#define CLEAR_SCREEN			0X01		//清屏
#define CURSOR_RESET			0X02		//光标复位

/*******************************************输入方式设置**************************************************/
#define SET_MOD					0X04		//配合一下两位来配置模式

#define SET_MOD_AC_ADD			0X02		//数据读写操作后AC自加一
#define SET_MOD_AC_DEC			0X00		//数据读写操作后AC自减一
#define SET_MOD_MOVE_ON			0X01		//数据读写操作后画面移动
#define SET_MOD_MOVE_OFF		0X00		//数据读写操作后画面不动

/*******************************************显示开关控制**************************************************/
#define DISPLAY_SET				0X08		//配合下面三位来配置模式

#define DISPLAY_SET_ON			0X04		//显示开
#define DISPLAY_SET_OFF			0X00		//显示关
#define DISPLAY_SET_CURSOR_ON	0X02		//光标显示开
#define DISPLAY_SET_CURSOR_OFF	0X00		//光标显示关
#define DISPLAY_SET_BLINK_ON	0X01		//光标闪烁
#define DISPLEY_SET_BLINK_OFF	0X00		//光标不闪烁

/*******************************************光标，画面位移************************************************/
#define COURSOR_SHIFT_LEFT		0X10		//光标左移一个字符位，AC减一
#define COURSOR_SHIFT_RIGHT		0X14		//光标右移一个字符位，AC加一
#define FRAME_SHIFT_LEFT		0X18		//画面左移一个字符位，光标不变
#define FRAME_SHIFT_RIGHT		0X1C		//画面右移一个字符位，光标不变

/*******************************************显示功能设置**************************************************/
#define DISPLAY_MOD				0X30		//默认设置为8位数据口，配合一下两个位来时配置模式
#define DISPLAY_MOD_TWO_LINE	0X08		//两行显示
#define DISPLAY_MOD_ONE_LINE	0X00		//一行显示
#define DISPLAY_MOD_5_10		0X04		//5*10的点阵字符显示
#define DISPLAY_MOD_5_7			0X00		//5*7的点阵字符显示

	
/*******************************************CGRAM起始地址**************************************************/

//uchar code CCGRAM_ADD = 0X40;

/*********************************************************************************************************
** 函数功能 ：读写LCD1602时用于读写时序的时钟延时
** 入口参数 ：z：延时长度
** 出口参数 ：无
*********************************************************************************************************/	 
extern void LCD_Delay(unsigned char z);


/*********************************************************************************************************
** 函数功能 ：LCD1602忙碌查询
** 函数说明 ：每次读写液晶时需要事先检测芯片是否处于忙碌状态
** 入口参数 ：无
** 出口参数 ：返回值为1：等待超时
**            返回值为0：芯片处于空闲状态
*********************************************************************************************************/
extern unsigned char Check_1602_Busy(void);


/*********************************************************************************************************
** 函数功能 ：向液晶写入指令
** 函数说明 ：
** 入口参数 ：待写入的指令
** 出口参数 ：无
*********************************************************************************************************/
extern void Write_1602_Com(unsigned char zhiling);//写指令


/*********************************************************************************************************
** 函数功能 ：向液晶写入数据
** 函数说明 ：
** 入口参数 ：待写入的数据，数据为LCD1062用来做显示用的，比如说shuju = 0x30，则显示“0”，
** 			  现成的字符数据可查询"LCD1602液晶完整中文资料.pdf"中“CGROM中字符码与字字符字模关系对照表”
** 出口参数 ：无
*********************************************************************************************************/
extern void Write_1602_Data(unsigned char shuju);//写数据


/*********************************************************************************************************
** 函数功能 ：在指定位置连续写入一串字符
** 函数说明 ：注意写入字符串的长度，不要超过屏幕单行的显示范围
** 入口参数 ：str：   待写入字符串首地址
**            addr：  写入液晶显示的地址
** 出口参数 ：无
*********************************************************************************************************/
extern void Write_1602_String(unsigned char *str,unsigned char addr);


/*********************************************************************************************************
** 函数功能 ：在指定位置写入一个整数
** 函数说明 ：整数的范围从0~65535，更大的需要采用long整型的进行扩展，注意整数的位数和地址不要超出显示范围
** 入口参数 ：number：待写入的整数
**            addr：  写入液晶显示的地址
** 出口参数 ：无
*********************************************************************************************************/
extern void Write_Num(unsigned int number,unsigned char addr);



/*********************************************************************************************************
** 函数功能 ：液晶初始化
** 函数说明 ：用液晶之前需要先初始化液晶，配置对应的显示模式
** 入口参数 ：time:需要延时的时间，单位ms
** 出口参数 ：无
*********************************************************************************************************/
extern void LCD_1602_Init(); //初始化



#endif

/*
void main()
{
	uchar i,temp;
	LCD_1602_Init(); //液晶显示前进行初始化
	Write_1602_String("I LIKE MCU 2012",0X80);
	Write_1602_Data(0x05);//自定义字符'年'
	Write_1602_String("By Blue Sky",0XC5);
	while(1)
	{
		if(temp == 0)
		{
			i++;
			Delay_ms(500);
			Write_1602_Com(FRAME_SHIFT_LEFT);//画面左移一个字符位			
			Write_1602_String("I LIKE MCU 2012",0x80+i);
			Write_1602_Data(0x05);	
			if(i == 5)temp = 1;		
		}

		else
		{
			i--;	
			Delay_ms(500);
			Write_1602_Com(FRAME_SHIFT_RIGHT);//画面右移一个字符位			
			Write_1602_String("I LIKE MCU 2012",0x80+i);
			Write_1602_Data(0x05);
			if(i == 0)temp = 0;			
		}
	}		
}

*/



