
/***************************************************************************************************    
工程名称：	timer
功能描述：	定时器0实现1s定时，流水灯显示上的数据每秒加1
硬件连接：  用8位杜邦线将J8与J13连接
维护记录：  2011-8-22
***************************************************************************************************/


#ifndef _TIME_H_
#define _TIME_H_

#include "STC12C5A60S2.H"      //包含头文件

  #ifndef uchar
	#define uchar unsigned char
  #endif

  #ifndef uint
	#define uint  unsigned int
  #endif



//*********************************************************************
//定时器0初始化   16位 10ms中断   可作为PCA时钟源（PWM）
//*********************************************************************
extern void Timer0_init(void);

//*********************************************************************
//定时器1初始化  16位定时器 1ms 中断 //优先级3(最高)
//*********************************************************************
extern void Timer1_Init(void);


#endif